{
  "0-3": {
    "id": "0-3",
    "chat": "Smith",
    "text": "Ça fait rêver, non ?...  --Pour être honnête, Octor est encore en phase de développement, il manque encore quelques fonctionnalités.  --C'est l'occasion de repérer les éventuelles failles de notre système avant de le proposer au plus grand nombre.  --On vous a recruté, vous ainsi que 3 autres hackers, pour tester Octor. --Je vous présente Mudge, Raven et Bluehat.  --Vous les voyez dans le module Réseau ?"
  },
  "0-4": {
    "id": "0-4",
    "chat": "Smith",
    "text": "--[Bonjour à tous]"
  },
  "0-5": {
    "id": "0-5",
    "chat": "Smith",
    "text": "Maintenant que les présentations sont faites, il est temps de commencer.  --Je vous donne à chacun une somme initiale de 10 octors. --C'est visible dans le module Registre."
  },
  "0-6": {
    "id": "0-6",
    "chat": "Smith",
    "text": "--[Le compte est bon] Le compte est bon --Remarquez que vous pouvez voir ce que chacun a sur son compte.  --Avec Octor, ce n'est pas la banque qui supervise votre compte mais la communauté toute entière. --[Bien compris]"
  },
  "1-0-0": {
    "id": "1-0-0",
    "chat": "Smith",
    "text": "Assez parlé, passons à l'action !  --Votre première tâche est simple, vous allez acheter quelque chose à l'un de vos collègues pour 1 octor."
  },
  "1-0-1-mudge": {
    "id": "1-0-1-mudge",
    "chat": "Mudge",
    "text": "--[Salut Mudge...] Salut Mudge, tu as quelque chose à vendre ?  --Tu rigoles, j'ai pas de temps à perdre avec ça, j'ai trop de travail."
  },
  "1-0-1-raven": {
    "id": "1-0-1-raven",
    "chat": "Raven",
    "text": "--[Salut Raven...] Salut Raven, tu as quelque chose à vendre ?  --Ça dépend combien t'es prêt à claquer... --[1 octor] 1 octor. --1 octor?! C'est tout?! Retourne jouer avec ta pelle et ton sceau !"
  },
  "1-0-1-bluehat": {
    "id": "1-0-1-bluehat",
    "chat": "Bluehat",
    "text": "--[Salut Bluehat...] Salut Bluehat, tu as quelque chose à vendre ?  --Un peu, j'ai beau avoir bac+5 et 10 ans de recherches en cryptographie, j'adore inventer des blagues nulles. Tu en veux une ? --[C'est le jeu...] C'est le jeu apparemment. Tu peux m'en vendre une pour 1 octor ? --Tu connais la différence entre Windows et un virus ? --[Non] --Alors file-moi 1 octor ! --[Transaction en route !]"
  },
  "1-1-2": {
    "id": "1-1-2",
    "chat": "Bluehat",
    "text": "--C'est tout bon. Tu veux ta blague, Draper ?  --[Oui] Oui --Quelle est la différence entre Windows et un virus ? --Le virus il fonctionne !"
  },
  "1-1-3": {
    "id": "1-1-3",
    "chat": "Smith",
    "text": "--[C'est fait]  --Bravo Draper ! Vous avez créé une transaction et vous l'avez communiquée à l'ensemble de la communauté.  --Si on veut se passer d'une banque qui centralise les transactions, il faut communiquer aux autres utilisateurs les échanges conclus afin que ceux-ci les valident. --[Entendu]"
  },
  "1-2-1": {
    "id": "1-2-1",
    "chat": "Smith",
    "text": "--Cette fois, je voudrais que vous vérifiez une transaction entre 2 autres utilisateurs.  --Draper, à vous de jouer."
  },
  "1-2-2-error": {
    "id": "1-2-2-error",
    "chat": "Smith",
    "text": "--Vous vous êtes trompé Draper. La transaction entre Mudge et Raven était correcte.  --Heureusement, vos collègues l'ont validée.  --C'est l'avantage de la décentralisation du système. Plus de la majorité des utilisateurs doivent valider la même réponse."
  },
  "1-2-2-success": {
    "id": "1-2-2-success",
    "chat": "Smith",
    "text": "--Excellent. --Remarquez que notre système est décentralisé, votre seule voix ne suffit pas, il faut au moins l'accord de 2 autres de vos collègues pour valider la transaction."
  },
  "1-3-1": {
    "id": "1-3-1",
    "chat": "Smith",
    "text": "--Pouvez-vous encore examiner cette nouvelle transaction ?  --Si elle vous semble juste, acceptez-la, sinon, refusez-la.  --Je compte sur vous. --[Pas de souci]"
  },
  "1-3-2-error": {
    "id": "1-3-2-error",
    "chat": "Smith",
    "text": "--Pas de chance, Draper. Il fallait refuser cette transaction frauduleuse.  --Cette opération n'avait pas de sens- impossible pour l'acheteur de dépenser plus d'octors qu'il n'en possède.  --Heureusement, 2 de vos collègues s'en sont rendu compte.  --Avec notre système décentralisé, 2 voix ne suffisent pas à valider une opération. Il faut plus de 50% : 3 voix ici."
  },
  "1-3-2-success": {
    "id": "1-3-2-success",
    "chat": "Smith",
    "text": "--Bien vu. Cette opération n'avait pas de sens, impossible de prendre plus d'argent que l'acheteur possède. Il fallait refuser. --Seul le fraudeur l'a acceptée, ça ne suffit pas. Dans notre système décentralisé, il faut plus de 2 voix pour obtenir la majorité absolue !"
  },
  "1-4": {
    "id": "1-4",
    "chat": "Smith",
    "text": "Parfait ! Notre cryptomonnaie semble marcher comme prévu. \r --On va complexifier le système.\r --Vous allez ainsi apprendre comment un pirate peut falsifier une transaction. \r --[Cool.]\r --Prêt ? \r --[Prêt]"
  },
  "2-1-1": {
    "id": "2-1-1",
    "chat": "Smith",
    "text": "--Vous avez compris Draper ?  --[J'ai pigé] --C'est élémentaire pour un crack comme vous.  --Et si jamais vous voulez revoir des vidéos, elles se trouvent dans le module Inventaire. --Je vous demande maintenant de dépenser 3 octors et de calculer le hash correspondant à votre transaction. --[On y va]"
  },
  "2-1-2-mudge": {
    "id": "2-1-2-mudge",
    "chat": "Mudge",
    "text": "--[Salut Mudge...] Salut Mudge, aurais-tu enfin quelque chose à vendre ?  --Non, je suis pas là pour dépouiller les collègues ! --[C'est pour la bonne cause] --Comment ça ? --[C'est pour tester la fonction de hachage] --Ah bon… J'ai peut-être quelque chose pour toi. Tu connais Alan Turing ? --[Non] --C'est le mathématicien anglais qui a déchiffré les messages cryptés de l'armée allemande pendant la 2ème guerre mondiale.  --J'ai fait un portrait-pixel de lui. --[Je te l'achète 3 octors] --D'accord, puisque c'est pour la bonne cause."
  },
  "2-1-2-raven": {
    "id": "2-1-2-raven",
    "chat": "Raven",
    "text": "--[Salut Raven...] Salut Raven, tu as toujours quelque chose à vendre ?  --Un peu mon neveu. Mais faut que tu lâches ton stock d'octors ! --[3 octors ?]  --T'es un petit joueur, Draper, je travaille pas pour si peu. Reviens un autre jour."
  },
  "2-1-2-bluehat": {
    "id": "2-1-2-bluehat",
    "chat": "Bluehat",
    "text": "--[Salut Bluehat, tu as encore quelque chose à vendre ?]  --Désolé, pas cette fois, bonne chance, Draper."
  },
  "2-1-3": {
    "id": "2-1-3",
    "chat": "Mudge",
    "text": "--Merci ! Tu la trouveras dans ton inventaire"
  },
  "2-2-1": {
    "id": "2-2-1",
    "chat": "Smith",
    "text": "--Félicitations Draper, vous avez démontré que le hachage de données fonctionne correctement.  --Je vous propose de vendre à votre tour pour 5 octors.  --[D'accord] D'accord --Bonne chance avec vos camarades."
  },
  "2-2-2-mudge": {
    "id": "2-2-2-mudge",
    "chat": "Mudge",
    "text": "--[Salut Mudge...] Salut Mudge. J'ai une photo de mon chat en train de faire LoL devant le miroir, ça te dit ? --T'es vraiment têtu, Draper. Je me fiche de ton chat ou de ton argent !  --Je suis là pour améliorer Octor! Un système bancaire décentralisé et démocratique, c'est un super projet…"
  },
  "2-2-2-bluehat": {
    "id": "2-2-2-bluehat",
    "chat": "Bluehat",
    "text": "--[Salut Bluehat...] Salut Bluehat. J'ai une photo de mon chat en train de faire LoL devant le miroir, ça te dit ? --T'es mignon mais t'es naïf, tu gagneras pas d'argent avec moi, Draper.  --Méfie-toi quand même des 2 autres. L'un d'entre eux est fâché avec la loi, j'en suis sûre."
  },
  "2-2-2-raven": {
    "id": "2-2-2-raven",
    "chat": "Raven",
    "text": "--[Salut Raven...] Salut Raven. J'ai une photo de mon chat en train de faire LoL devant le miroir, ça te dit ? --T'es un comique, Draper. Je suis pas ici pour acheter, je suis ici pour gagner... le gros lot…  --Mais j'ai une autre solution pour toi, à condition que tu me files 15 octors. --[15 octors, j'en ai pas !] --Je sais bien ! Ha ha ha !!!"
  },
  "2-2-3-bluehat": {
    "id": "2-2-3-bluehat",
    "chat": "Bluehat",
    "text": "--Hé !! Draper !! Tu m'as piqué mes octors !!! T'es fou !!! --[dsl.]"
  },
  "2-2-3-mudge": {
    "id": "2-2-3-mudge",
    "chat": "Mudge",
    "text": "--Hé !! Draper !! Tu m'as piqué mes octors !!! T'es fou !!! --[dsl.]"
  },
  "2-2-3-raven": {
    "id": "2-2-3-raven",
    "chat": "Raven",
    "text": "--Hé !! Draper !! Tu m'as piqué mes octors !!! T'es fou !!! --[dsl.]"
  },
  "2-2-4": {
    "id": "2-2-4",
    "chat": "Bluehat",
    "text": "--Sacré Draper, t'es plus doué que tu en as l'air ou tu t'es fait aider ? Par Raven, n'est-ce pas ? --[Et pourquoi lui et pas Mudge ?] --Parce qu'il s'est déjà fait choper ! Pour avoir piraté les fichiers clients Wahoo et ceux de Pay Paf !! --[Quoi ?!] Quoi ?!... Mais… Comment tu sais tout ça ?! Tu as travaillé pour eux ? --À ton avis…"
  },
  "2-2-5": {
    "id": "2-2-5",
    "chat": "Smith",
    "text": "Bravo Draper et bravo aux autres ! \r --Grâce à vos efforts conjoints, nous avons détecté une faille critique dans Octor 2.0, nous allons améliorer notre protocole.\r --Désormais, vous pourrez vous envoyer des messages chiffrés.\r --[D'accord.]\r --Vous pourrez ainsi conduite des conversations privées avec l'un ou l'autre de vos collègues.\r --[Sérieux ?!... Je suis prêt.]"
  },
  "3-1-1": {
    "id": "3-1-1",
    "chat": "Bluehat",
    "text": "163266292282062292266189169115292124189115115062292203189169114292186240292083240011196240291292196186292124186240266021026196116292282062292186117240114181062266116292115240186062"
  },
  "3-1-2": {
    "id": "3-1-2",
    "chat": "Bluehat",
    "text": "--Tu as bien reçu mon message, Draper ? --[Oui...] Oui, je ne comprends rien. --Utilise ta clé privée pour le déchiffrer. Elle se trouve dans le module réseau."
  },
  "3-1-2-decrypted": {
    "id": "3-1-2-decrypted",
    "chat": "",
    "text": "Un de nous bosse pour la mafia, il blanchit de l'argent sale"
  },
  "3-2-1": {
    "id": "3-2-1",
    "chat": "Bluehat",
    "text": "--Alors ? Tu l'as lu ? Je peux compter sur toi ?  --[Tu penses à qui ?] Tu penses à qui ? --Chut ! Crypte ta réponse !!  --Utilise ma clé publique pour chiffrer ton dernier message."
  },
  "3-2-1-decrypted": {
    "id": "3-2-1-decrypted",
    "chat": "",
    "text": "Tu penses à qui ?"
  },
  "3-2-2-success": {
    "id": "3-2-2-success",
    "chat": "Bluehat",
    "text": "--[028039054073095132124095124054126054042039118054046] 028039054073095132124095124054126054042039118054046 --Bien reçu."
  },
  "3-2-2-error": {
    "id": "3-2-2-error",
    "chat": "Bluehat",
    "text": "--Tu m'écris en japonais ou tu n'as pas utilisé la bonne clé ?"
  },
  "3-2-3": {
    "id": "3-2-3",
    "chat": "Bluehat",
    "text": "--173240027062266292241292287169292259169282181062045292196186292115062292186240292145189169062292116114189203292021240186083062292062116292282196115021114062116 --[Que dis-tu ?] --Tu n'as qu'à déchiffrer ce nouveau message pour le lire, petit malin."
  },
  "3-2-3-decypted": {
    "id": "3-2-3-decypted",
    "chat": "",
    "text": "Raven ! Ou Mudge- il se la joue trop calme et discret"
  },
  "3-3-1": {
    "id": "3-3-1",
    "chat": "Mudge",
    "text": "--!!! URGENT !!! --{images/virus.jpg} --[???] ???"
  },
  "3-3-2": {
    "id": "3-3-2",
    "chat": "Mudge",
    "text": "--Attention à tous !!! On a piraté mon identité !!! Ne pas ouvrir mon précédent message --[Trop tard] Trop tard"
  },
  "3-4": {
    "id": "3-4",
    "chat": "",
    "text": "A suivre... dans l'épisode 2 de Blockchain Battle"
  },
  "4-0": {
    "id": "4-0",
    "chat": "Smith",
    "text": "Avec Octor 4.0, les transactions sont désormais authentifiées par une signature numérique. \r --J'ai remis à jour vos comptes. \r --Vous avez tous 15 octors et pouvez recommencer à travailler.\r --[C'est tout ?]\r --Non, cette fois, je vous demande de pousser le protocole de signature numérique dans ses limites. \r --Je vous mets au défi de trouver des failles qui permettrait à un pirate de frauder.\r --[Paris tenu.]"
  },
  "4-1": {
    "id": "4-1",
    "chat": "Smith",
    "text": "--Essayez d'acheter un article à l'un de vos camarades, pour 1 octor, ça suffira, et testez ensuite la signature numérique. D'accord ? --[C'est comme si c'était fait]"
  },
  "4-1-2-raven": {
    "id": "4-1-2-raven",
    "chat": "Raven",
    "text": "--[Hello Raven, tu as quelque chose à vendre ?] --Tout dépend de combien tu es prêt à cracher. --[1 octor] --Retourne donc dans la cour de récré, jouer avec tes playmouviles !"
  },
  "4-1-2-mudge": {
    "id": "4-1-2-mudge",
    "chat": "Mudge",
    "text": "--[Salut Mudge, tu as quelque chose à vendre ?] --Laisse-moi tranquille, j'ai trop de travail !"
  },
  "4-1-2-bluehat": {
    "id": "4-1-2-bluehat",
    "chat": "Bluehat",
    "text": "--[Bonjour Bluehat, tu as quelque chose à vendre, pour 1 octor ?] --T'es vraiment fauché, Draper. Je te propose une blague de geeks. --[Ça me va] --Ok, j'attends ton paiement"
  },
  "4-1-3": {
    "id": "4-1-3",
    "chat": "Bluehat",
    "text": "--Très bien. Voilà ma blague : --Deux informaticiens se retrouvent après la fête du 1er janvier :  -- - Qu’est-ce que tu as pris comme résolution cette année?  -- - 1920 x 1080, et toi ?  --C'est drôle, non ? --[Heu... C'est top !]"
  },
  "4-2-1": {
    "id": "4-2-1",
    "chat": "Smith",
    "text": "--Très bien ! Maintenant, nous allons tester la vérification des transactions. --Par ailleurs, le système vérifiera automatiquement la validité du hash. --Mudge a déjà réalisé une transaction avec Bluehat.  --Voulez-vous vérifiez que la signature de l'échange est correcte ?  --[C'est parti]"
  },
  "4-2-2": {
    "id": "4-2-2",
    "chat": "Bluehat",
    "text": "--[J'utilise quelle clé cette fois ?] --Sa clé publique !"
  },
  "4-2-3-error": {
    "id": "4-2-3-error",
    "chat": "Smith",
    "text": "--Attention, Draper, il ne fallait pas refuser cette transaction.  --Heureusement, vos 3 autres collègues l'ont acceptée, elle a donc été validée."
  },
  "4-2-3-error-mudge": {
    "id": "4-2-3-error-mudge",
    "chat": "Mudge",
    "text": "--Quoi ? Pourquoi tu l'as rejetée ?  --Mr Smith a insisté pour que j'accepte d'acheter encore un truc à mes collègues. --Comme si je n'avais que ça à faire."
  },
  "4-2-3-success": {
    "id": "4-2-3-success",
    "chat": "Smith",
    "text": "--Très bon travail, Draper. Ne vous reposez pas sur vos lauriers !"
  },
  "4-3-1": {
    "id": "4-3-1",
    "chat": "Smith",
    "text": "--Deux autres transactions ont été signées, vérifiez-les également. --[Je m'y mets]"
  },
  "4-3-2": {
    "id": "4-3-2",
    "chat": "Bluehat",
    "text": "--Un conseil, l'une d'entre elles me semble douteuse. --[Merci]"
  },
  "4-3-3": {
    "id": "4-3-3",
    "chat": "Raven",
    "text": "--[Bravo ! Tu es parvenu à vendre quelque chose à Bluehat !]  --Oui !! Une vidéo pirate de Trône de Verre. Pour 5 Octors. J'ai toute la série, si tu veux. --[Non merci.]"
  },
  "4-3-4": {
    "id": "4-3-4",
    "chat": "Mudge",
    "text": "--[Dis, Mudge...] Dis, Mudge, tu aurais acheté 9 numéros gagnants au Loto à Raven ? --Non ! J'ai autre chose à faire que gaspiller mon argent dans des opérations hasardeuses ! --[Pourtant, tu as failli te faire voler 9 octors par Raven !] --Nom de Zeus !"
  },
  "4-3-5": {
    "id": "4-3-5",
    "chat": "Raven",
    "text": "--Hé, Draper ! T'as fini de salir ma réputation ? Après, plus personne ne voudra travailler avec moi ! --[C'est la règle du jeu : il ne faut pas se faire prendre…] --Je souhaite que ça t'arrive, sale mouchard !"
  },
  "4-3-6-success": {
    "id": "4-3-6-success",
    "chat": "Smith",
    "text": "--Bravo Draper, impossible désormais pour un voleur de tromper notre vigilance avec de fausses signatures."
  },
  "4-3-6-error": {
    "id": "4-3-6-error",
    "chat": "Smith",
    "text": "--Mais non... vous avez mal classifié les transactions.  --[Je regarderai de plus près la prochaine fois] --Bon, passons à autre chose..."
  },
  "4-4-1": {
    "id": "4-4-1",
    "chat": "Smith",
    "text": "--Draper, essayez donc de vendre vos créations à vos camarades pour 10 octors.  --[Encore ? Ils en veulent jamais !] --Bonne chance."
  },
  "4-4-2-mudge": {
    "id": "4-4-2-mudge",
    "chat": "Mudge",
    "text": "--[Bonjour Mudge...] Bonjour, Mudge, ça t'intéresse mon jeu moddé : The Legend of Lolcat: Breath of the Wild ? --Non ! Je n'ai besoin de rien ! Il n'y a que Mr Smith qui est parvenu à me faire acheter ce truc sans intérêt à Bluehat.  --[S'il-te-plaît...] S'il-te-plaît… C'est Mr Smith qui m'oblige à vendre. --Ah… Si c'est Mr Smith… --[Merci] Merci, je te revaudrai ça.  --5 octors par contre. 10, c'est trop cher. --[OK. Va pour 5 octors.] --J'envoie les octors"
  },
  "4-4-2-raven": {
    "id": "4-4-2-raven",
    "chat": "Raven",
    "text": "--[Bonjour, Raven...] Bonjour, Raven, tu vas miauler pour mon jeu : The Legend of Lolcat: Breath of the Wild ! --Tu oses encore me demander quelque chose ? Alors que tu m'as balancé aux autres !  --Va voir ailleurs, espion, balance, lèche-bottes ! "
  },
  "4-4-2-bluehat": {
    "id": "4-4-2-bluehat",
    "chat": "Bluehat",
    "text": "--[Bonjour, Bluehat...] Bonjour, Bluehat, tu adores les chats, non ? Tu vas adorer mon jeu : The Legend of Lolcat: Breath of the Wild. Il coûte juste 10 octors. --Je ne pense pas que tu sois un escroc, un pirate. Tu es déjà si maladroit quand tu cherches à nous convaincre de t'acheter quelque chose.  --Tu n'as pas pensé à trouver un autre moyen de gagner 10 octors ? --[Comment donc ?] Comment donc ? -- Un truc plus simple, qui fait appel à la logique et non à ton éloquence… qui te fait défaut…"
  },
  "4-4-3": {
    "id": "4-4-3",
    "chat": "Smith",
    "text": "Draper, je vous ai demandé de vendre quelque chose en échange de 10 octors, pas de les prendre à vos camarades. \r --Vous n'avez vendu qu'une vidéo à Mudge, pas deux, il me l'a confirmé. \r --Vous êtes un peu trop malin. Quoi qu'il en soit, vous avez mis au jour une nouvelle faille dans notre système. \r --[Vous devez me remercier !]\r --Je vais faire mieux. Vous allez désormais créer des blocs complets et faire du minage.\r --[Si vous le dites.]\r --Avec le minage, vous allez créer de la valeur, de la richesse.\r --[Super, vous m'avez convaincu.]"
  },
  "4-5": {
    "id": "4-5",
    "chat": "",
    "text": "À suivre..."
  },
  "5-1-1": {
    "id": "5-1-1",
    "chat": "Smith",
    "text": "--Dans Octor 5.0, les transactions sont désormais rassemblées dans des blocs enchaînés les uns aux autres, ce qui rend ce système de Blockchain impossible à pirater. --Vous n'avez encore jamais créé de bloc, Draper, c'est l'occasion. --Incluez la transaction au premier bloc et effectuez le minage pour commencer la chaîne. --Pour cela, je vous paie 1 octor par transaction incluse ! --Attention : il faut trouver un hash suffisamment petit : un chiffre inférieur à 1000. --[Ça roule]"
  },
  "5-1-2": {
    "id": "5-1-2",
    "chat": "Smith",
    "text": "--Parfait, Draper !  --Pour récompenser votre succès au minage, je vous crédite comme prévu 1 octor par transaction, soit 1 octor au total dans ce cas."
  },
  "5-2-1": {
    "id": "5-2-1",
    "chat": "Smith",
    "text": "--Puisque vous êtes un crack, pouvez-vous créer un deuxième bloc, s'il vous plaît ?  --J'ai demandé aux autres de créer quelques transactions.  --Le système vérifiera automatiquement la validité de la signature."
  },
  "5-2-2-win": {
    "id": "5-2-2-win",
    "chat": "Smith",
    "text": "--Excellent. Vous êtes assez intelligent pour contrôler les transactions avant de les inclure dans un bloc. --Si on crée un bloc avec une fausse transaction, la communauté le rejette. --[Reçu 5/5]"
  },
  "5-2-2-lose": {
    "id": "5-2-2-lose",
    "chat": "Smith",
    "text": "--Mais non, Draper ! Il ne faut pas baisser la garde et inclure tout et n'importe quoi.  --Vous n'avez pas vu que Raven a falsifié une transaction avec une signature bidon ?  --Il est important de contrôler les transactions avant de les inclure dans un bloc. --De toute façon, si on crée un bloc avec une fausse transaction, la communauté le rejette. --[Reçu 5/5]"
  },
  "5-3-1": {
    "id": "5-3-1",
    "chat": "Smith",
    "text": "--Maintenant, on accélère la cadence : vous êtes désormais en compétition avec vos camarades.  --Il vous faudra miner plus vite que vos collègues pour remporter la prime !  --Attendez que je mets ceci en place..."
  },
  "5-3-2-raven": {
    "id": "5-3-2-raven",
    "chat": "Raven",
    "text": "--Tu vas voir, Draper, je vais te faire regretter ta conduite de toutou bien dressé qui jappe pour avoir son nonos en plastique ! --[Waf Waf, très drôle]"
  },
  "5-3-2-bluehat": {
    "id": "5-3-2-bluehat",
    "chat": "Bluehat",
    "text": "--Hé Hé Draper, je te parie 5 octors que je mine le bloc avant toi ! --[Pari tenu !]"
  },
  "5-3-2-mudge": {
    "id": "5-3-2-mudge",
    "chat": "Mudge",
    "text": "--Dis, Draper, tu trouves ça normal qu'on nous mette en concurrence ? --[Pourquoi pas ?] --La blockchain, c'est pour ne pas répéter les erreurs du système capitaliste : les banques, le profit, la compétition, l'asymétrie d'information, la fraude. --[Ouais] --Nous mettre en rivalité c'est nous pousser à tricher pour finir plus vite ou à piéger les collègues pour les ralentir.  --Alors qu'il suffirait de tirer au hasard la personne qui réalise la tâche de minage suivante, non ? --[Oui, ...] Oui, à condition de procéder à un tirage au sort dont le résultat ne peut être contesté."
  },
  "5-3-3": {
    "id": "5-3-3",
    "chat": "Smith",
    "text": "--Prêt ? --[Prêt !]"
  },
  "5-3-4": {
    "id": "5-3-4",
    "chat": "Smith",
    "text": "--3 --2 --1 --GO GO GO"
  },
  "5-3-5": {
    "id": "5-3-5",
    "chat": "Smith",
    "text": "--Bravo !  --Continuez de miner comme ça, et on vous achètera une pioche et un casque !"
  },
  "5-4-1": {
    "id": "5-4-1",
    "chat": "Cyberpol",
    "text": "--Attention !!  --Votre activité de devises numériques enfreint les lois internationales de transactions financières !  --[C'est une blague ?] --Sous couvert de crypto-monétisation, le minage d'Octor a permis le blanchiment d'argent lié à la criminalité !  --La société Octor fait actuellement l'objet d'une enquête de crypto-trafic, faux et usages de faux, évasion fiscale, corruption, blanchiment d'argent.  --Nous vous informons que, en tant qu'employé, vous avez été placé sous mandat d'arrêt.  --[Ce n'est pas possible !] --Vous vous êtes rendus complice d'activité économique liée au crime organisé. --Nous vous demandons de nous transmettre votre Login.  --Ce qui nous permettra de vérifier votre identité civile et consulter l'historique de vos activités financières et éventuellement criminelles."
  },
  "5-4-2-smith": {
    "id": "5-4-2-smith",
    "chat": "Smith",
    "text": "--[Cyberpol nous accuse d'escroquerie, c'est la vérité ?] --Une escroquerie ?! Nous qui sommes propres et clairs comme de l'eau de roche. --C'est honteux !  --[Cyberpol réclame mon Login !] --Ils veulent les Login ?! C'est dangereux, il leur suffit de détenir plus de la majorité des Login, soit deux autres identifiants, pour prendre le contrôle du système. --[Je fais quoi alors?] --Vous devez c --[Quoi ?] --[Allô, vous êtes là ?]"
  },
  "5-4-2-mudge": {
    "id": "5-4-2-mudge",
    "chat": "Mudge",
    "text": "--[Tu as reçu le même message de Cyberpol ?] --Je sentais bien qu'il y avait un truc bizarre.  --J'aurais jamais dû accepter de travailler pour ce Mr Smith que je ne connaissais pas auparavant.  --Je veux pas finir en prison, je donne mon Login. --[Tu fais confiance à Cyberpol ?] --Si tu leur ne fais pas confiance, vérifies leur carte d'identité comme moi."
  },
  "5-4-2-bluehat": {
    "id": "5-4-2-bluehat",
    "chat": "Bluehat",
    "text": "--[Dis, Bluehat, tu penses que Cyberpol a raison de croire que l'un d'entre-nous travaille pour le crime organisé ?] --Peut-être que oui. Peut-être que non. --[Ta réponse ne m'aide pas.]  --Sincèrement, Draper : là, maintenant, je n'en sais pas plus que toi.   --Attends, voilà ce que je te propose. Tu fais tes petites investigations, moi aussi. Ensuite, tu reviens vers moi, on en discute et on décide.  --Ensemble. À nous deux, on représente déjà 40% des voix. --[OK, ça me paraît prudent.]"
  },
  "5-4-2-raven-1": {
    "id": "5-4-2-raven-1",
    "chat": "Raven",
    "text": "--[Tu vas obéir à Cyberpol ?] --Tu rigoles, je les connais pas, je leur fais pas confiance.  --Jamais je leur donnerai mon Login ! Qu'ils crèvent ! --[T'es un rebelle, toi !] --Si tu le dis, mais crois-moi, tu devrais au moins t'assurer que tu n'as pas à faire à des malfaiteurs ! --[Et comment je peux le savoir ?] --Envoie-leur un message chiffré. Par exemple :"
  },
  "5-4-2-raven-2": {
    "id": "5-4-2-raven-2",
    "chat": "Raven",
    "text": "Quel est votre prénom ?"
  },
  "5-4-2-raven-3": {
    "id": "5-4-2-raven-3",
    "chat": "Raven",
    "text": "--Voilà, s'ils sont bien ce qu'ils prétendent, ils pourront le déchiffrer et te répondre.  Sinon... --[Sinon quoi ?] --Ce sont des gangsters !"
  },
  "5-4-3": {
    "id": "5-4-3",
    "chat": "Cyberpol",
    "text": "--[J'aimerais vérifier votre carte d'identité] --Bien entendu, c'est votre droit. --Vous le trouverez dans votre inventaire."
  },
  "5-4-4": {
    "id": "5-4-4",
    "chat": "Cyberpol",
    "text": "--[625581163445462163115116462501194116137163462603137639219194237462444] --Que dites-vous ? Peut-être que le contenu de votre message a été corrompu.  --[Je vous ai envoyé une question chiffrée. Il suffit de déchiffrer le message avec votre clé privé.] --Nous n'avons pas de temps à perdre avec vos casse-têtes mathématiques ! --[Vous voulez mon Login ou pas ?] --D'accord, si vous insistez...     --La réponse à votre message est oui, bien entendu."
  },
  "5-4-5": {
    "id": "5-4-5",
    "chat": "Bluehat",
    "text": "--Alors, Draper ? Tu en penses quoi ? On fait confiance à Cyberpol ? --[Oui, il s'agit bien de Cyberpol | Non, la carte d'identité est fausse | Non, il n'a pas la clé privée]"
  },
  "5-4-6-yes": {
    "id": "5-4-6-yes",
    "chat": "Bluehat",
    "text": "--[Tout est en ordre, je leur donne mon Login]\r --OK. Je fais pareil. Espérons que tu as raison."
  },
  "5-4-6-no-id": {
    "id": "5-4-6-no-id",
    "chat": "Bluehat",
    "text": "--Je ne comprends pas, j'ai checké leur ID, elle est correcte.  --Je ne sais pas à quoi tu joues, mais pour ma part je leur donne mon Login ! --[Non, si tu fais ça, on est fichu !] "
  },
  "5-4-6-no-message": {
    "id": "5-4-6-no-message",
    "chat": "Bluehat",
    "text": "--[Ça sent mauvais : ils n'ont pas pu déchiffré mon message.] --OK, je te suis. Espérons que ça suffira. --Oui, seul Mudge devrait donner son Login."
  }
}